## Terraform Plan Results

✅ Plan succeeded

<details>
<summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.firestore.google_firebaserules_release.firestore must be replaced
-/+ resource "google_firebaserules_release" "firestore" {
      ~ create_time  = "2025-11-21T06:03:58.712046Z" -> (known after apply)
      ~ disabled     = false -> (known after apply)
      ~ id           = "projects/wedding-smile-catcher/releases/cloud.firestore" -> (known after apply)
        name         = "cloud.firestore"
      ~ ruleset_name = "projects/wedding-smile-catcher/rulesets/c010c28a-0ac1-478f-876b-4a518315bcbd" -> "3c5b7fab-3ffc-4b00-89cf-e9342bca35d9" # forces replacement
      ~ update_time  = "2025-11-23T15:03:03.022362Z" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.firestore.google_firestore_database.database will be updated in-place
  ~ resource "google_firestore_database" "database" {
        id                                = "projects/wedding-smile-catcher/databases/(default)"
        name                              = "(default)"
      ~ point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED" -> "POINT_IN_TIME_RECOVERY_ENABLED"
        # (15 unchanged attributes hidden)
    }

  # module.functions.data.archive_file.scoring_source will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "scoring_source" {
      + excludes            = [
          + "*.pyc",
          + ".DS_Store",
          + ".env",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../src/functions/scoring"
      + type                = "zip"
    }

  # module.functions.data.archive_file.webhook_source will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "webhook_source" {
      + excludes            = [
          + "*.pyc",
          + ".DS_Store",
          + ".env",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../src/functions/webhook"
      + type                = "zip"
    }

  # module.functions.google_cloudfunctions2_function.scoring will be updated in-place
  ~ resource "google_cloudfunctions2_function" "scoring" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/scoring"
        name             = "scoring"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/scoring-8ce5867637c7db22f30d3ee4ca5f776c.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.functions.google_cloudfunctions2_function.webhook will be updated in-place
  ~ resource "google_cloudfunctions2_function" "webhook" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/webhook"
        name             = "webhook"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/webhook-ffa6a547ba318d2631dc1383dff9b4b7.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.functions.google_storage_bucket_object.scoring_source must be replaced
-/+ resource "google_storage_bucket_object" "scoring_source" {
      + content          = (sensitive value)
      ~ content_type     = "application/zip" -> (known after apply)
      ~ crc32c           = "b3lKQQ==" -> (known after apply)
      ~ detect_md5hash   = "jOWGdjfH2yLzDT7kyl93bA==" -> "different hash"
      - event_based_hold = false -> null
      ~ generation       = 1763707534543187 -> (known after apply)
      ~ id               = "wedding-smile-images-wedding-smile-catcher-functions/scoring-8ce5867637c7db22f30d3ee4ca5f776c.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "jOWGdjfH2yLzDT7kyl93bA==" -> (known after apply)
      ~ md5hexhash       = "8ce5867637c7db22f30d3ee4ca5f776c" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fscoring-8ce5867637c7db22f30d3ee4ca5f776c.zip?generation=1763707534543187&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "functions/scoring-8ce5867637c7db22f30d3ee4ca5f776c.zip" # forces replacement -> (known after apply) # forces replacement
      ~ output_name      = "functions/scoring-8ce5867637c7db22f30d3ee4ca5f776c.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fscoring-8ce5867637c7db22f30d3ee4ca5f776c.zip" -> (known after apply)
      ~ source           = "./.terraform/tmp/scoring-20251121064533.zip" # forces replacement -> (known after apply) # forces replacement
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (1 unchanged attribute hidden)
    }

  # module.functions.google_storage_bucket_object.webhook_source must be replaced
-/+ resource "google_storage_bucket_object" "webhook_source" {
      + content          = (sensitive value)
      ~ content_type     = "application/zip" -> (known after apply)
      ~ crc32c           = "3+gXJg==" -> (known after apply)
      ~ detect_md5hash   = "/6alR7oxjSYx3BOD3/m0tw==" -> "different hash"
      - event_based_hold = false -> null
      ~ generation       = 1763707534786127 -> (known after apply)
      ~ id               = "wedding-smile-images-wedding-smile-catcher-functions/webhook-ffa6a547ba318d2631dc1383dff9b4b7.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "/6alR7oxjSYx3BOD3/m0tw==" -> (known after apply)
      ~ md5hexhash       = "ffa6a547ba318d2631dc1383dff9b4b7" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fwebhook-ffa6a547ba318d2631dc1383dff9b4b7.zip?generation=1763707534786127&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "functions/webhook-ffa6a547ba318d2631dc1383dff9b4b7.zip" # forces replacement -> (known after apply) # forces replacement
      ~ output_name      = "functions/webhook-ffa6a547ba318d2631dc1383dff9b4b7.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fwebhook-ffa6a547ba318d2631dc1383dff9b4b7.zip" -> (known after apply)
      ~ source           = "./.terraform/tmp/webhook-20251121064533.zip" # forces replacement -> (known after apply) # forces replacement
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (1 unchanged attribute hidden)
    }

  # module.storage.google_storage_bucket.images will be updated in-place
  ~ resource "google_storage_bucket" "images" {
      ~ force_destroy               = true -> false
        id                          = "wedding-smile-images-wedding-smile-catcher"
        name                        = "wedding-smile-images-wedding-smile-catcher"
        # (16 unchanged attributes hidden)

      ~ cors {
          ~ origin          = [
              - "*",
              + "https://wedding-smile-catcher.web.app",
              + "https://wedding-smile-catcher.firebaseapp.com",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 4 to change, 3 to destroy.
```

</details>

**Pusher**: @nakayamaryo0731
**Action**: pull_request
